package lotto;

public class Note {

    /*
     *ㄱ.로또 카운트
     * 구입금액을 입력받아 몇개를 구매했는지 계산해주는 함수
     *
     *
     *ㄴ.로또 넘버클래스
     *장수에 맞춰 1 부터 45까지의 숫자중 랜덤으로 뽑아서 리스트로 전달하는 기능
     *
     *ㄷ.로또 당첨결과
     * 당첨번호를 입력해서 리스트에 저장하는 함수
     * 로또 넘버클래스에서 넘겨받은 로또 번호를 당첨번호와 비교하는 함수
     * 수익률과 등수 계산
     *
     * 개선하고 싶은 사항 :
     * UI 에서 맞춘 개수를 넘겨받아 등수와 수익률을 계산하는 부분이 쓸데 없이 길어져서 다른 클래스에서 계산하고
     * 넘겨주고 싶음
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     * */
}
